; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=9, floors=17, out_folder=training/easy, instance_id=83, seed=110

(define (problem miconic-83)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 f13 f14 f15 f16 f17 - floor
    )
 (:init 
    (lift-at f13)
    (origin p1 f8)
    (destin p1 f15)
    (origin p2 f16)
    (destin p2 f9)
    (origin p3 f3)
    (destin p3 f15)
    (origin p4 f17)
    (destin p4 f11)
    (origin p5 f2)
    (destin p5 f5)
    (origin p6 f17)
    (destin p6 f3)
    (origin p7 f5)
    (destin p7 f16)
    (origin p8 f1)
    (destin p8 f15)
    (origin p9 f8)
    (destin p9 f10)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f1 f13)
    (above f1 f14)
    (above f1 f15)
    (above f1 f16)
    (above f1 f17)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f2 f13)
    (above f2 f14)
    (above f2 f15)
    (above f2 f16)
    (above f2 f17)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f3 f13)
    (above f3 f14)
    (above f3 f15)
    (above f3 f16)
    (above f3 f17)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f4 f13)
    (above f4 f14)
    (above f4 f15)
    (above f4 f16)
    (above f4 f17)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f5 f13)
    (above f5 f14)
    (above f5 f15)
    (above f5 f16)
    (above f5 f17)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f6 f13)
    (above f6 f14)
    (above f6 f15)
    (above f6 f16)
    (above f6 f17)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f7 f13)
    (above f7 f14)
    (above f7 f15)
    (above f7 f16)
    (above f7 f17)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f8 f13)
    (above f8 f14)
    (above f8 f15)
    (above f8 f16)
    (above f8 f17)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f9 f13)
    (above f9 f14)
    (above f9 f15)
    (above f9 f16)
    (above f9 f17)
    (above f10 f11)
    (above f10 f12)
    (above f10 f13)
    (above f10 f14)
    (above f10 f15)
    (above f10 f16)
    (above f10 f17)
    (above f11 f12)
    (above f11 f13)
    (above f11 f14)
    (above f11 f15)
    (above f11 f16)
    (above f11 f17)
    (above f12 f13)
    (above f12 f14)
    (above f12 f15)
    (above f12 f16)
    (above f12 f17)
    (above f13 f14)
    (above f13 f15)
    (above f13 f16)
    (above f13 f17)
    (above f14 f15)
    (above f14 f16)
    (above f14 f17)
    (above f15 f16)
    (above f15 f17)
    (above f16 f17)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3)
   (served p4)
   (served p5)
   (served p6)
   (served p7)
   (served p8)
   (served p9))))

; plan
1. (down f13 f1)
   deleted: (lift-at f13)
   added: (lift-at f1)
   goals met: 0 of 9
2. (board f1 p8)
   deleted: (origin p8 f1)
   added: (boarded p8)
   goals met: 0 of 9
3. (up f1 f17)
   deleted: (lift-at f1)
   added: (lift-at f17)
   goals met: 0 of 9
4. (board f17 p6)
   deleted: (origin p6 f17)
   added: (boarded p6)
   goals met: 0 of 9
5. (board f17 p4)
   deleted: (origin p4 f17)
   added: (boarded p4)
   goals met: 0 of 9
6. (down f17 f11)
   deleted: (lift-at f17)
   added: (lift-at f11)
   goals met: 0 of 9
7. (depart f11 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 1 of 9
8. (down f11 f2)
   deleted: (lift-at f11)
   added: (lift-at f2)
   goals met: 1 of 9
9. (board f2 p5)
   deleted: (origin p5 f2)
   added: (boarded p5)
   goals met: 1 of 9
10. (up f2 f3)
   deleted: (lift-at f2)
   added: (lift-at f3)
   goals met: 1 of 9
11. (depart f3 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 2 of 9
12. (board f3 p3)
   deleted: (origin p3 f3)
   added: (boarded p3)
   goals met: 2 of 9
13. (up f3 f5)
   deleted: (lift-at f3)
   added: (lift-at f5)
   goals met: 2 of 9
14. (board f5 p7)
   deleted: (origin p7 f5)
   added: (boarded p7)
   goals met: 2 of 9
15. (depart f5 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 3 of 9
16. (up f5 f16)
   deleted: (lift-at f5)
   added: (lift-at f16)
   goals met: 3 of 9
17. (depart f16 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 4 of 9
18. (board f16 p2)
   deleted: (origin p2 f16)
   added: (boarded p2)
   goals met: 4 of 9
19. (down f16 f8)
   deleted: (lift-at f16)
   added: (lift-at f8)
   goals met: 4 of 9
20. (board f8 p9)
   deleted: (origin p9 f8)
   added: (boarded p9)
   goals met: 4 of 9
21. (board f8 p1)
   deleted: (origin p1 f8)
   added: (boarded p1)
   goals met: 4 of 9
22. (up f8 f10)
   deleted: (lift-at f8)
   added: (lift-at f10)
   goals met: 4 of 9
23. (depart f10 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 5 of 9
24. (down f10 f9)
   deleted: (lift-at f10)
   added: (lift-at f9)
   goals met: 5 of 9
25. (depart f9 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 6 of 9
26. (up f9 f15)
   deleted: (lift-at f9)
   added: (lift-at f15)
   goals met: 6 of 9
27. (depart f15 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 7 of 9
28. (depart f15 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 8 of 9
29. (depart f15 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 9 of 9
